In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'shubh'],
    "marks":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'bareilly', 'antartica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [5]:
df.to_csv('friends.csv')

In [10]:
print(1)

1

In [12]:
d2 = df[(df['name']=='harry') & (df['marks']==92)]

In [13]:
print(d2)

    name  marks    city
0  harry     92  rampur

In [18]:
print(df[(df['name'] == 'harry')])

    name  marks    city
0  harry     92  rampur

In [24]:
print(df[('arry' == df['name'])])

Empty DataFrame
Columns: [name, marks, city]
Index: []